* Plano do Projeto Experimental


** Versões

Temos três versões do Fletcher para comparar com:
- fletcher-base
  - Single Node
- fletcher-riggon
  - Single Node
  - Multi GPU
- fletcher-spadotto
  - Multi nodo
  - Usa MPI

As análises precisam ser comparativas com essas 3 implementações.
Mesmo a versão base e a do Riggon serem similares em relação a máquinas com uma GPU,
é necessário testar nas duas as implementações.

** Máquinas

| Máquina | Nº GPUS | Local         |
|---------|---------|---------------|
| grace   |       1 | PCAD          |
| cidia   |       2 | PCAD          |
| tupi    |       1 | PCAD          |
| poti    |       1 | PCAD          |
| saude   |       3 | PCAD          |
| xh3000  |       4 | Santos Dumond |
| H100_dx |       4 | Santos Dumond |

O plano é executar experimentos em todas essas máquinas.


** Parâmetros

Precisamos fixar o maior tamanho possível de meio para as execuções.
Se não me engano, o /fletcher-base/ tem uma limitação de tamanho de 600 x 600 x 600,
mas precisamos de um experimento que demonstre isso.
(ou não, talvez só tentar execuções incrementais até o crash seria suficiente).
Cada máquina tem uma configuração ideal de segmentação.
Precisamos montar um projeto experimental para determinar isso. Nele temos:
- Um tamanho de meio fixo
- Um número de iterações fixa (10)
- Uso de IO (com ou sem)
- O número de passos para salvar o meio (fixar em algum valor arbitrário igual para todos)
- O número de replicações
- Tamanho da segmentação
- Tipo do escalonador
  |--------+----------------------------------------------------+-------------|
  | name   | descriptor                                         | performance |
  |--------+----------------------------------------------------+-------------|
  | eager  | queue central, não faz prefetch                    | no          |
  | random | random                                             | no          |
  | ws     | worker rouba a task de outro caso este esteja idle | no          |
  | lws    | tipo ws, mas local                                 | no          |
  | dm     | usa tempo de execução                              | yes         |
  | dmda   | tipo dm, mas conta com o tempo de transferência    | yes         |
  | dmdar  | tipo dmda, mas considera o local                   | yes         |

Não estamos incluindo outros escalonadores que levam em consideração a prioridade das tasks,
pois estes são desnecessários. O star-fletcher é dominado por uma única task.

** Experimento para determinar tamanho do bloco

TODO: Ler sobre os escalonadores e adicioná-los no projeto experimental,
que com GPU eles fazem a diferença.


#+BEGIN_SRC R :session *R*
  library(DoE.base)
  library(glue)
  library(tidyverse)
  library(numbers)

  #no scientific notation
  options(scipen = 999)


  total_width = 576
  border_size = 4
  absorb_size = 8
  width = total_width - 2 * (border_size + absorb_size)
  seed = 0
  time_step = 0.00001
  iterations = 20
  output = 5 # output every 5 steps
  replications = 5

  generate_experiment <- function(factors, replications, seed) {
    DoE.base::fac.design(
      nfactors = length(factors),
      replications = replications,
      repeat.only = FALSE,
      randomize = TRUE,
      seed = seed,
      nlevels = sapply(factors, length),
      factor.names = factors
    )
  }

  segmentations = divisors(total_width)

  cpu_factors <- list(
    WithIO =  c(0, 1),
    BlockSeg = segmentations[segmentations > 3 & segmentations < 48],
    Schedulers = c("lws", "dm", "dmda", "dmdar")
  )

  ex <- generate_experiment(cpu_factors, replications, seed) |>
    as_tibble() |>
    mutate(
  	Width = width,
  	AbsorbSize = absorb_size,
  	BorderSize = border_size,
  	TotalTime = format(time_step * iterations, scientific = FALSE),
  	TimeStep = format(time_step, scientific = FALSE),
  	OutputTime = format(time_step * output, scientific = FALSE)
    )


  #print(dim(ex))

  #ex |> readr::write_csv(glue("./ideal-seg/ideal-block-segment.csv"))

#+END_SRC

#+RESULTS:
| 1 | 18 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | lws   | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmdar | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmda  | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dm    | 0.1 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmda  | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | lws   | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmdar | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dm    | 0.2 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmda  | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | lws   | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dm    | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmdar | 0.3 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmda  | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dm    | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmdar | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | lws   | 0.4 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  4 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 24 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  8 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 12 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 32 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 32 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  9 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  8 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 12 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  6 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 16 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 18 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 |  6 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 16 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 36 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 0 | 18 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  9 | dmdar | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 24 | lws   | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 |  4 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dmda  | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |
| 1 | 36 | dm    | 0.5 | 552 | 8 | 4 | 0.0002 | 1e-05 | 5e-05 |


** Pendências

Atualmente o Star-Fletcher está quase correto quanto a compilação em CUDA.
Porém ainda estou tendo alguns erros com o hwloc, que é importante de corrigir
para que não haja erros na distribuição do problema.

Gepeto fix. É uma configuração correta dada a página do hwloc.
https://hwloc.readthedocs.io/en/master/doxygen/html/faq.html#faq_cuda_build

there is also the /--enable-cuda/ flag, which fails the build if CUDA is not present.

#+BEGIN_SRC nix
fixedCudaHwloc = cudaHwloc.overrideAttrs (oldAttrs: {
    configureFlags = (oldAttrs.configureFlags or []) ++ [
	"--with-cuda=${cudaPackages.cuda_cudart}"
    ];
});
#+END_SRC

Além disso tenho que ver quais são os escalonadores disponíveis e quais seriam interessantes
de adicionar no projeto experimental.

 - Resolvido: tem que passar o hwloc com gpu para o star-fletcher também.
   
* Análise de Dados



#+BEGIN_SRC R :session *R* :async yes :results output silent 
   options(crayon.enabled = FALSE)
   #library(starvz)
   library(tidyverse)
   library(ggplot2)
   library(dplyr)
   library(patchwork)

   base_dir = "./ideal-seg/results"

   machines <- tribble(
     ~Machine, ~Processor, ~Ghz, ~Threads, ~Cores, ~GPU, ~GPU_count, ~GPU_gb_mem,
     "cidia", "2 x Intel(R) Xeon(R) Silver 4208", 2.1, 32, 16, "NVIDIA GeForce RTX 2080 Ti", 2, 11,
     "tupi3", "Intel(R) Core(TM) i9-14900KF", 3.2, 32, 24, "NVIDIA GeForce RTX 4090", 1, 24,
     "tupi4", "Intel(R) Core(TM) i9-14900KF", 3.2, 32, 24, "NVIDIA GeForce RTX 4090", 1, 24,
     "poti5", "Intel(R) Core(TM) i7-14700KF", 3.4, 28, 20, "NVIDIA GeForce RTX 4070", 1, 12,
     "saude", "Intel(R) Xeon(R) E5-2620 v4", 2.1, 16, 8, "NVIDIA GeForce GTX 1080 Ti", 3, 11,
     "grace", "2 x Grace A02", 3.4, 144, 144, "NVIDIA L40S", 1,  46
   )

   ex_star_fletcher <- read_csv('./ideal-seg/ideal-block-segment.csv')
   ex_fletcher_base <- read_csv('./ideal-seg/base-test.csv')

   sf <- machines |> cross_join(ex_star_fletcher)
   fb <- machines |> cross_join(ex_fletcher_base)

   sf_res <- sf |>
     mutate(FILE = paste0(base_dir,"/ideal-block-size-machine/", Machine ,"/stdout-", Schedulers, "-", BlockSeg, "-", WithIO, "-", substring(1, Blocks), ".out")) |>
     mutate(Msamples = map_dbl(FILE, function(file) {
       #print(file)
       lines <- tryCatch({
   	read_lines(file)
       }, error = function(e){
   	#message(paste0("Warning: Failed to read file: ", file, ". Skipping..."))
   	return(NA_real_) # Returns NULL instead of breaking the script
       })
        lines |>
         tail(1) |>
         str_remove("Msamples/s: ") |>
         as.numeric()
     })) |>
     filter(!is.na(Msamples)) |>
     mutate(Order = (Width + 2 * (AbsorbSize + BorderSize)) / BlockSeg) 


  fb_res <- fb |>
    mutate(FILE = paste0(base_dir,"/fletcher-base-max-size/", Machine ,"/stdout-",  WithIO, "-", substring(1, Blocks), ".out")) |>
    mutate(Msamples = map_dbl(FILE, function(file) {
       lines <- tryCatch({
   	read_lines(file)
       }, error = function(e){
   	#message(paste0("Warning: Failed to read file: ", file, ". Skipping..."))
   	return(NA_real_) # Returns NULL instead of breaking the script
       })
      res <- lines |>
        str_subset("MSamples/s") |> 
        str_extract("[\\d.]+") |> 
        as.numeric()
      res[1]
    })) |>
    filter(!is.na(Msamples)) 
  #|>
   # group_by(across(-c(replication, Msamples, FILE))) |>
    #summarize(Mean = mean(Msamples), Min = min(Msamples), Max = max(Msamples)) |> print()

#+END_SRC

#+BEGIN_SRC R :session *R* :async yes

    plot_msamples <- function(io_state){
      x_breaks <- sort(unique(sf_res$Order))

      max_fb <- fb_res |>
  	filter(WithIO == io_state) |>
  	group_by(Processor) |>
  	summarize(Max_Msamples = max(Msamples, na.rm = TRUE), Min_Msamples = min(Msamples, na.rm = TRUE), .groups = "drop") #|>
  	# Join back to machines so the hline can inherit the exact Machine color
  	#left_join(machines |> select(Machine, Processor), by = "Processor")
      
      ggplot(sf_res |> filter(WithIO == io_state), aes(x = Order, y = Msamples, color = Processor)) +
      geom_jitter(width = 2, alpha = 0.3) +
      geom_hline(data = max_fb, aes(yintercept = Max_Msamples, color = Processor), linetype = "dashed", linewidth = 0.8) +
      #geom_hline(yintercept = max_samples, color = "red", linewidth = 0.5) +
      scale_x_continuous(breaks = x_breaks) +
      #scale_y_continuous(trans='log2') +
      ylim(0,NA)+
      facet_grid(~ Schedulers) + 
      labs(
  	title = paste0("Msamples vs. Block Order when WithIO = ", io_state),
  	subtitle = "Faceted by Scheduler",
  	x = "Block Size",
  	y = "Msamples/s"
      ) +
      theme_bw(base_size=15) +
      theme(legend.position = "bottom")
  }

    #plot_msamples(0) / plot_msamples(1)
  plot_msamples(0)
      
#+END_SRC

#+RESULTS:
